Group Members:
B V Krishna Bharadwaj	2015A7PS0076H
Manish Rao Sangi	2015A7PS0235H
Tanuj Gupta		2015A7PS0159H
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 100)               78500
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050
_________________________________________________________________
dense_3 (Dense)              (None, 25)                1275
_________________________________________________________________
dense_4 (Dense)              (None, 12)                312
_________________________________________________________________
dense_5 (Dense)              (None, 10)                130
=================================================================
Total params: 85,267
Trainable params: 85,267
Non-trainable params: 0
_________________________________________________________________
None
Train loss: 0.016607252533968893
Train accuracy: 0.9956428571428572
Validation loss: 0.20348565394721096
Validation accuracy: 0.9654444444444444
Test loss: 0.17910280069776927
Test accuracy: 0.9691

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 24, 24, 50)        1300
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 50)          0
_________________________________________________________________
flatten_1 (Flatten)          (None, 800)               0
_________________________________________________________________
dense_1 (Dense)              (None, 50)                40050
_________________________________________________________________
dense_2 (Dense)              (None, 25)                1275
_________________________________________________________________
dense_3 (Dense)              (None, 12)                312
_________________________________________________________________
dense_4 (Dense)              (None, 10)                130
=================================================================
Total params: 43,067
Trainable params: 43,067
Non-trainable params: 0
_________________________________________________________________
None
Train loss: 0.016875998911640464
Train accuracy: 0.9951428571428571
Validation loss: 0.11118125495050724
Validation accuracy: 0.9807222223281861
Test loss: 0.10525662904516649
Test accuracy: 0.9818
